In [1]:
import pandas as pd

In [2]:
# check the current directory 
pwd

'C:\\Users\\shaha\\PycharmProjects\\TensorFlow-for-Deep-Learning\\Basic'

In [5]:
# read Csv file
data = pd.read_csv('salary.csv')
# see the first 5 value of csv
data.head()

    name  salary  Age
0  name0    1000   30
1  name1    2000   32
2  name2    3000   36
3  name3    4000   34
4  name4    5000   38

In [6]:
# select collumn
data['salary']

0    1000
1    2000
2    3000
3    4000
4    5000
5    6000
6    7000
7    8000
8    8000
9    9000
Name: salary, dtype: int64

In [7]:
# multiple collumn
data[['salary','Age']]

   salary  Age
0    1000   30
1    2000   32
2    3000   36
3    4000   34
4    5000   38
5    6000   40
6    7000   43
7    8000   44
8    8000   45
9    9000   54

In [8]:
# check the max salary
data['salary'].max()

9000

In [9]:
# find details
data.describe()

            salary        Age
count    10.000000  10.000000
mean   5300.000000  39.600000
std    2750.757471   7.183314
min    1000.000000  30.000000
25%    3250.000000  34.500000
50%    5500.000000  39.000000
75%    7750.000000  43.750000
max    9000.000000  54.000000

### Filter

In [11]:
data['salary'] > 5000

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
9     True
Name: salary, dtype: bool

In [12]:
# convert numpy
data.as_matrix()

array([['name0', 1000, 30],
       ['name1', 2000, 32],
       ['name2', 3000, 36],
       ['name3', 4000, 34],
       ['name4', 5000, 38],
       ['name5', 6000, 40],
       ['name6', 7000, 43],
       ['name7', 8000, 44],
       ['name8', 8000, 45],
       ['name9', 9000, 54]], dtype=object)